fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ПериодПриИзменении(Элемент)
	Объект.ВКМ_Период = КонецМесяца(Объект.ВКМ_Период);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_СозданныеДокументы
&НаКлиенте 
Процедура ВКМ_СозданныеДокументыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СозданныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте               
Процедура ВКМ_СозданныеДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Создать(Команда)
	ВКМ_ЗапуститьСозданиеДокументов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ЗапуститьСозданиеДокументов()
	// Проверка заполнения реквизитов на клиенте
	Если Не ЗначениеЗаполнено(Объект.ВКМ_Организация) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана организация";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан период";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ВКМ_СоздатьДокументыНаСервере(); 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Новый ОписаниеОповещения("ПриЗавершенииСозданияДокументов", ЭтотОбъект), ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция ВКМ_СоздатьДокументыНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_ОбщийМодуль.СоздатьАкты", Объект.ВКМ_Период, Объект.ВКМ_Организация);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
	  	Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = Результат.ПодробноеПредставлениеОшибки;
        Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	РезультатЗначение = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);     
		
	Для Каждого ТекСтруктура Из РезультатЗначение Цикл  
		НоваяСтрока = Объект.ВКМ_СозданныеДокументы.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтруктура);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
